tests/rayTracing/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamRun;

solver          compressibleVoF;

startFrom       startTime;

startTime       0;

stopAt          endTime;
//stopAt          nextWrite;

endTime         0.02;

deltaT          0.0001;

writeControl    adjustableRunTime;

writeInterval   0.002;

purgeWrite      0;

writeFormat     binary;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   10;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           0.5;
maxAlphaCo      0.5;
maxDeltaT       1;

libs ("liblaserDTRM.so");

// ************************************************************************* //

DebugSwitches
{
    laserDTRM   1;
    DTRMParticle 1;
    fresnelLaser 1;
}

OptimisationSwitches
{
    fileHandler collated;
}